{
  "auto_mapping": {
    "base_model_class": "UNet2DConditionModel",
    "parent_library": "diffusers.models.unets.unet_2d_condition"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "boft_block_num": 8,
  "boft_block_size": 0,
  "boft_dropout": 0.1,
  "boft_n_butterfly_factor": 1,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "peft_type": "BOFT",
  "peft_version": "0.18.1",
  "revision": null,
  "target_modules": [
    "to_v",
    "to_k",
    "to_out.0",
    "to_q"
  ],
  "task_type": null
}